[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Generates a detection alert each time a 'Container Workload Protection' alert is received. Enabling this rule allows you
to immediately begin triaging and investigating these alerts.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-10m"
index = ["logs-cloud_defend.alerts-*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 10000
name = "Container Workload Protection [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "0de6ec2d-bbb5-441d-a078-e26417208651"
rule_name_override = "message"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Data Source: Elastic Defend for Containers", "Domain: Container"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.kind:alert and event.module:cloud_defend
'''

