[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies a high number (25) of failed Microsoft 365 user authentication attempts from a single IP address within 30
minutes, which could be indicative of a password spraying attack. An adversary may attempt a password spraying attack to
obtain unauthorized access to user accounts.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Automated processes that attempt to authenticate using expired credentials and unbounded retries may lead to false
    positives.
    """,
]
from = "now-30m"
index = ["filebeat-*", "logs-o365*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Potential Password Spraying of Microsoft 365 User Accounts [Duplicate]"
note = ""
references = []
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "533c3ced-f77c-4054-8476-00aad14da7c4"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: Microsoft 365",
    "Use Case: Identity and Access Audit",
    "Tactic: Credential Access",
]
timestamp_override = "event.ingested"
to = "now"
type = "threshold"

query = '''
event.dataset:o365.audit and event.provider:(Exchange or AzureActiveDirectory) and event.category:authentication and
event.action:("UserLoginFailed" or "PasswordLogonInitialAuthUsingPassword")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = ["source.ip"]
value = 25

