[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies the attempt to disable Network-Level Authentication (NLA) via registry modification. Network Level
Authentication (NLA) is a feature on Windows that provides an extra layer of security for Remote Desktop (RDP)
connections, as it requires users to authenticate before allowing a full RDP session. Attackers can disable NLA to
enable persistence methods that require access to the Windows sign-in screen without authenticating, such as
Accessibility Features persistence methods, like Sticky Keys.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-9m"
index = ["logs-endpoint.events.registry-*", "endgame-*", "logs-logen-*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Network-Level Authentication (NLA) Disabled [Duplicate]"
references = [
    "https://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/",
]
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "6901297d-92da-4e6d-a7e8-c8c27ddfce97"
setup = ""
severity = "low"
severity_mapping = []
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend",
    "Data Source: Elastic Endgame",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
registry where host.os.type == "windows" and event.action != "deletion" and
  registry.path :
       ("HKLM\\SYSTEM\\ControlSet*\\Control\\Terminal Server\\WinStations\\RDP-Tcp\\UserAuthentication", 
        "\\REGISTRY\\MACHINE\\SYSTEM\\*ControlSet*\\Control\\Terminal Server\\WinStations\\RDP-Tcp\\UserAuthentication" ) and
  registry.data.strings : "0"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1112"
name = "Modify Registry"
reference = "https://attack.mitre.org/techniques/T1112/"

[[rule.threat.technique]]
id = "T1562"
name = "Impair Defenses"
reference = "https://attack.mitre.org/techniques/T1562/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

