[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Generates a detection alert each time an Elastic Endpoint Security alert is received. Enabling this rule allows you to
immediately begin investigating your Endpoint alerts.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-10m"
index = ["logs-endpoint.alerts-*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 10000
name = "Endpoint Security [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 47
rule_id = "b85b8c52-8f8c-4589-afd3-739781a6a49b"
rule_name_override = "message"
setup = ""
severity = "medium"
tags = ["Data Source: Elastic Defend"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.kind:alert and event.module:(endpoint and not endgame)
'''


[[rule.risk_score_mapping]]
field = "event.risk_score"
operator = "equals"
value = ""

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "low"
value = "21"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "medium"
value = "47"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "high"
value = "73"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "critical"
value = "99"


