[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Generates a detection alert for each external alert written to the configured indices. Enabling this rule allows you to
immediately begin investigating external alerts in the app.
"""
enabled = true
exceptions_list = []
false_positives = []
filters = []
from = "now-360s"
index = [
    "apm-*-transaction*",
    "traces-apm*",
    "auditbeat-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "winlogbeat-*",
    "logs-logen-*",
]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 10000
name = "External Alerts - Firewall [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 47
rule_id = "ed29b420-fc14-4bc4-a9ca-ee59ead67fb3"
rule_name_override = "rule.name"
setup = ""
severity = "medium"
tags = ["OS: Windows", "Data Source: APM", "OS: macOS", "OS: Linux"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.kind:alert and not event.module:(endgame or endpoint or cloud_defend) and rule.name:*
'''


[[rule.risk_score_mapping]]
field = "event.risk_score"
operator = "equals"
value = ""

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "low"
value = "21"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "medium"
value = "47"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "high"
value = "73"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "critical"
value = "99"

[rule.alert_suppression]
group_by = ["source.address"]
missing_fields_strategy = "doNotSuppress"

[rule.meta]
from = "1m"
kibana_siem_app_url = ""

