[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies Elasticsearch nodes that do not have Transport Layer Security (TLS), and/or lack authentication, and are
accepting inbound network connections over the default Elasticsearch port.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    If you have front-facing proxies that provide authentication and TLS, this rule would need to be tuned to eliminate
    the source IP address of your reverse-proxy.
    """,
]
from = "now-9m"
index = ["packetbeat-*", "logs-network_traffic.*", "logs-logen-*"]
interval = "5m"
language = "lucene"
license = "Elastic License v2"
max_signals = 100
name = "Inbound Connection to an Unsecure Elasticsearch Node [Duplicate]"
note = ""
references = [
    "https://www.elastic.co/guide/en/elasticsearch/reference/current/configuring-security.html",
    "https://www.elastic.co/guide/en/beats/packetbeat/current/packetbeat-http-options.html#_send_all_headers",
]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "097c48cd-74c1-4121-b4f1-c15fe67946d4"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Use Case: Threat Detection", "Tactic: Initial Access", "Domain: Endpoint"]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
(event.dataset: network_traffic.http OR (event.category: network_traffic AND network.protocol: http)) AND
    status:OK AND destination.port:9200 AND network.direction:inbound AND NOT http.response.headers.content-type:"image/x-icon" AND NOT
    _exists_:http.request.headers.authorization
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1190"
name = "Exploit Public-Facing Application"
reference = "https://attack.mitre.org/techniques/T1190/"


[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

