[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
This rule detects an incoming SSH connection established inside a running container. Running an ssh daemon inside a
container should be avoided and monitored closely if necessary. If an attacker gains valid credentials they can use it
to gain initial access or establish persistence within a compromised environment.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    SSH usage may be legitimate depending on the environment. Access patterns and follow-on activity should be analyzed
    to distinguish between authorized and potentially malicious behavior.
    """,
]
from = "now-6m"
index = ["logs-cloud_defend*", "logs-logen-*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "SSH Connection Established Inside A Running Container [Duplicate]"
references = [
    "https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/SSH%20server%20running%20inside%20container/",
]
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "7ef8db50-06f3-419f-b133-df9cdbac5da0"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Data Source: Elastic Defend for Containers",
    "Domain: Container",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Initial Access",
    "Tactic: Lateral Movement",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
process where container.id: "*" and event.type == "start" and 

/* use of sshd to enter a container*/
process.entry_leader.entry_meta.type: "sshd"  and 

/* process is the initial process run in a container or start of a new session*/
(process.entry_leader.same_as_process== true or process.session_leader.same_as_process== true) and 

/* interactive process*/
process.interactive== true
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1133"
name = "External Remote Services"
reference = "https://attack.mitre.org/techniques/T1133/"


[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"
[[rule.threat.technique.subtechnique]]
id = "T1021.004"
name = "SSH"
reference = "https://attack.mitre.org/techniques/T1021/004/"



[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

