[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic", "Austin Songer"]
description = """
Identifies when a transfer lock was removed from a Route 53 domain. It is recommended to refrain from performing this
action unless intending to transfer the domain to a different registrar.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    A domain transfer lock may be disabled by a system or network administrator. Verify whether the user identity, user
    agent, and/or hostname should be making changes in your environment. Activity from unfamiliar users or hosts should
    be investigated. If known behavior is causing false positives, it can be exempted from the rule.
    """,
]
from = "now-60m"
index = ["filebeat-*", "logs-aws.cloudtrail-*", "logs-logen-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "AWS Route 53 Domain Transfer Lock Disabled [Duplicate]"
note = ""
references = [
    "https://docs.aws.amazon.com/Route53/latest/APIReference/API_Operations_Amazon_Route_53.html",
    "https://docs.aws.amazon.com/Route53/latest/APIReference/API_domains_DisableDomainTransferLock.html",
]
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "1d4f6f06-78be-4b3e-bd70-79df07b558db"
setup = ""
severity = "low"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: AWS Route53",
    "Use Case: Asset Visibility",
    "Tactic: Persistence",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:route53.amazonaws.com and event.action:DisableDomainTransferLock and event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1098"
name = "Account Manipulation"
reference = "https://attack.mitre.org/techniques/T1098/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[rule.threat]]
framework = "MITRE ATT&CK"
technique = []

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

