[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
An adversary may add the setuid or setgid bit to a file or directory in order to run a file with the privileges of the
owning user or group. An adversary can take advantage of this to either do a shell escape or exploit a vulnerability in
an application with the setuid or setgid bit to get code running in a different user’s context. Additionally,
adversaries can use this mechanism on their own malware to make sure they're able to execute in elevated contexts in the
future.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*", "logs-logen-*"]
interval = "5m"
language = "lucene"
license = "Elastic License v2"
max_signals = 33
name = "Setuid / Setgid Bit Set via chmod [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "8b2d8a52-e6c7-49d4-a1bc-b515a3047bfb"
setup = ""
severity = "low"
severity_mapping = []
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Data Source: Elastic Defend",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.category:process AND event.type:(start OR process_started) AND
 process.name:chmod AND process.args:("+s" OR "u+s" OR /4[0-9]{3}/ OR g+s OR /2[0-9]{3}/) AND
 NOT process.args:
           (
             /.*\/Applications\/VirtualBox.app\/.+/ OR
             /\/usr\/local\/lib\/python.+/ OR
             /\/var\/folders\/.+\/FP.*nstallHelper/ OR
             /\/Library\/Filesystems\/.+/ OR
             /\/usr\/lib\/virtualbox\/.+/ OR
             /\/Library\/Application.*/ OR
             "/run/postgresql" OR
             "/var/crash" OR
             "/var/run/postgresql" OR
             /\/usr\/bin\/.+/ OR /\/usr\/local\/share\/.+/ OR
             /\/Applications\/.+/ OR /\/usr\/libexec\/.+/ OR
             "/var/metrics" OR /\/var\/lib\/dpkg\/.+/ OR
             /\/run\/log\/journal\/.*/ OR
             \/Users\/*\/.minikube\/bin\/docker-machine-driver-hyperkit
           ) AND
 NOT process.parent.executable:
           (
             /\/var\/lib\/docker\/.+/ OR
             "/System/Library/PrivateFrameworks/PackageKit.framework/Versions/A/XPCServices/package_script_service.xpc/Contents/MacOS/package_script_service" OR
             "/var/lib/dpkg/info/whoopsie.postinst"
           )
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[rule.threat.technique.subtechnique]]
id = "T1548.001"
name = "Setuid and Setgid"
reference = "https://attack.mitre.org/techniques/T1548/001/"



[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
[[rule.threat]]
framework = "MITRE ATT&CK"
technique = []

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

