[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies a privilege escalation attempt via rogue named pipe impersonation. An adversary may abuse this technique by
masquerading as a known named pipe and manipulating a privileged process to connect to it.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.sysmon_operational-*", "logs-logen-*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Privilege Escalation via Rogue Named Pipe Impersonation [Duplicate]"
references = [
    "https://itm4n.github.io/printspoofer-abusing-impersonate-privileges/",
    "https://github.com/zcgonvh/EfsPotato",
    "https://twitter.com/SBousseaden/status/1429530155291193354",
]
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "178e1b0f-46d8-491d-be67-99a075404e66"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Data Source: Sysmon",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
file where host.os.type == "windows" and event.action : "Pipe Created*" and
 /* normal sysmon named pipe creation events truncate the pipe keyword */
  file.name : "\\*\\Pipe\\*"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1134"
name = "Access Token Manipulation"
reference = "https://attack.mitre.org/techniques/T1134/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

