[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
A request to a web application returned a 405 response, which indicates the web application declined to process the
request because the HTTP method is not allowed for the resource.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Security scans and tests may result in these errors. Misconfigured or buggy applications may produce large numbers
    of these errors. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate
    suspicious or malicious activity.
    """,
]
from = "now-6m"
index = ["apm-*-transaction*", "traces-apm*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Octo DAC Web Application Suspicious Activity: Unauthorized Method [Duplicate]"
references = ["https://en.wikipedia.org/wiki/HTTP_405"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "70028fec-4850-40ef-972b-6d7ae6ad7bd4"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Data Source: APM"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
http.response.status_code:405
'''

