[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
A POST request to a web application returned a 403 response, which indicates the web application declined to process the
request because the action requested was not allowed.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Security scans and tests may result in these errors. Misconfigured or buggy applications may produce large numbers
    of these errors. If the source is unexpected, the user unauthorized, or the request unusual, these may indicate
    suspicious or malicious activity.
    """,
]
from = "now-6m"
index = ["apm-*-transaction*", "traces-apm*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Web Application Suspicious Activity: POST Request Declined [Duplicate]"
references = ["https://en.wikipedia.org/wiki/HTTP_403"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "c81329d6-1399-4c28-98e9-ea67ec8a4cd6"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Data Source: APM"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
http.response.status_code:403 and http.request.method:post
'''

