[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies suspicious file download activity from a Google Drive URL. This could indicate an attempt to deliver phishing
payloads via a trusted webservice.
"""
enabled = true
exceptions_list = []
false_positives = [
    "Approved third-party applications that use Google Drive download URLs.",
    "Legitimate publicly shared files from Google Drive.",
]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint*", "logs-system.security*", "logs-logen-*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Suspicious File Downloaded from Google Drive [Duplicate]"
references = ["https://intelligence.abnormalsecurity.com/blog/google-drive-matanbuchus-malware"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "30f4d798-7789-45aa-9458-0a63bf496cd5"
setup = ""
severity = "medium"
severity_mapping = []
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: Windows",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Command and Control",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
process where

    /* common browser processes  */
    event.action in ("exec", "fork", "start") and 

    process.name : ("Microsoft Edge", "chrome.exe", "Google Chrome", "google-chrome-stable", 
                    "google-chrome-beta", "google-chrome", "msedge.exe", "firefox.exe", "brave.exe", 
                    "whale.exe", "browser.exe", "dragon.exe", "vivaldi.exe", "opera.exe", "firefox", 
                    "powershell.exe", "curl", "curl.exe", "wget", "wget.exe") and 

    /* Look for Google Drive download URL with AV flag skipping */
    (process.command_line : "*drive.google.com*" and process.command_line : "*export=download*" and process.command_line : "*confirm=no_antivirus*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1105"
name = "Ingress Tool Transfer"
reference = "https://attack.mitre.org/techniques/T1105/"


[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

