[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic", "Willem D'Haese", "Austin Songer"]
description = """
Identifies attempts to brute force a Microsoft 365 user account. An adversary may attempt a brute force attack to obtain
unauthorized access to user accounts.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Automated processes that attempt to authenticate using expired credentials and unbounded retries may lead to false
    positives.
    """,
]
from = "now-30m"
index = ["filebeat-*", "logs-o365*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Attempts to Brute Force a Microsoft 365 User Account [Duplicate]"
note = ""
references = ["https://blueteamblog.com/7-ways-to-monitor-your-office-365-logs-using-siem"]
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "440604fd-05fa-420e-a01a-c9da84d0308d"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: Microsoft 365",
    "Use Case: Identity and Access Audit",
    "Tactic: Credential Access",
]
timestamp_override = "event.ingested"
to = "now"
type = "threshold"

query = '''
event.dataset:o365.audit and event.provider:(AzureActiveDirectory or Exchange) and
  event.category:authentication and event.action:(UserLoginFailed or PasswordLogonInitialAuthUsingPassword) and
  not o365.audit.LogonError:(UserAccountNotFound or EntitlementGrantsNotFound or UserStrongAuthEnrollmentRequired or
                             UserStrongAuthClientAuthNRequired or InvalidReplyTo)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = ["user.id"]
value = 10

