[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Detects when an external (anonymous) user has viewed, copied or downloaded an encryption key file from a Google
Workspace drive. Adversaries may gain access to encryption keys stored in private drives from rogue access links that do
not have an expiration. Access to encryption keys may allow adversaries to access sensitive data or authenticate on
behalf of users.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    A user may generate a shared access link to encryption key files to share with others. It is unlikely that the
    intended recipient is an external or anonymous user.
    """,
]
from = "now-130m"
index = ["filebeat-*", "logs-google_workspace*", "logs-logen-*"]
interval = "10m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Google Workspace Drive Encryption Key(s) Accessed from Anonymous User [Duplicate]"
note = """### Important Information Regarding Google Workspace Event Lag Times
- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.
- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.
- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.
- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).
- See the following references for further information:
  - https://support.google.com/a/answer/7061566
  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html"""
references = ["https://support.google.com/drive/answer/2494822"]
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "790d5d6b-8055-4939-8db1-a36f146cee67"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: Google Workspace",
    "Use Case: Configuration Audit",
    "Tactic: Credential Access",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
file where event.dataset == "google_workspace.drive" and event.action : ("copy", "view", "download") and
    google_workspace.drive.visibility: "people_with_link" and source.user.email == "" and
    file.extension: (
        "token","assig", "pssc", "keystore", "pub", "pgp.asc", "ps1xml", "pem", "gpg.sig", "der", "key",
        "p7r", "p12", "asc", "jks", "p7b", "signature", "gpg", "pgp.sig", "sst", "pgp", "gpgz", "pfx", "crt",
        "p8", "sig", "pkcs7", "jceks", "pkcs8", "psc1", "p7c", "csr", "cer", "spc", "ps2xml")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1552"
name = "Unsecured Credentials"
reference = "https://attack.mitre.org/techniques/T1552/"
[[rule.threat.technique.subtechnique]]
id = "T1552.004"
name = "Private Keys"
reference = "https://attack.mitre.org/techniques/T1552/004/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

