[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Austin Songer"]
description = """
Identifies the deletion of a Frontdoor Web Application Firewall (WAF) Policy in Azure. An adversary may delete a
Frontdoor Web Application Firewall (WAF) Policy in an attempt to evade defenses and/or to eliminate barriers to their
objective.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Azure Front Web Application Firewall (WAF) Policy deletions may be done by a system or network administrator. Verify
    whether the username, hostname, and/or resource name should be making changes in your environment. Azure Front Web
    Application Firewall (WAF) Policy deletions by unfamiliar users or hosts should be investigated. If known behavior
    is causing false positives, it can be exempted from the rule.
    """,
]
from = "now-25m"
index = ["filebeat-*", "logs-azure*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Azure Frontdoor Web Application Firewall (WAF) Policy Deleted [Duplicate]"
note = ""
references = [
    "https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#networking",
]
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "4063e5cb-04e7-49f6-8667-d78b04b86187"
setup = ""
severity = "low"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: Azure",
    "Use Case: Network Security Monitoring",
    "Tactic: Defense Evasion",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:azure.activitylogs and azure.activitylogs.operation_name:"MICROSOFT.NETWORK/FRONTDOORWEBAPPLICATIONFIREWALLPOLICIES/DELETE" and event.outcome:(Success or success)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1562"
name = "Impair Defenses"
reference = "https://attack.mitre.org/techniques/T1562/"
[[rule.threat.technique.subtechnique]]
id = "T1562.001"
name = "Disable or Modify Tools"
reference = "https://attack.mitre.org/techniques/T1562/001/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

