[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
This rule detects when a service account makes an unauthorized request for resources from the API server. Service
accounts follow a very predictable pattern of behavior. A service account should never send an unauthorized request to
the API server. This behavior is likely an indicator of compromise or of a problem within the cluster. An adversary may
have gained access to credentials/tokens and this could be an attempt to access or create resources to facilitate
further movement or execution within the cluster.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Unauthorized requests from service accounts are highly abnormal and more indicative of human behavior or a serious
    problem within the cluster. This behavior should be investigated further.
    """,
]
from = "now-6m"
index = ["logs-kubernetes.*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Kubernetes Denied Service Account Request [Duplicate]"
note = ""
references = [
    "https://research.nccgroup.com/2021/11/10/detection-engineering-for-kubernetes-clusters/#part3-kubernetes-detections",
    "https://kubernetes.io/docs/reference/access-authn-authz/authentication/#service-account-tokens",
]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "2e84d1b4-1b3f-4293-b165-561e1aee5dd8"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Data Source: Kubernetes", "Tactic: Discovery"]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset: "kubernetes.audit_logs"
  and kubernetes.audit.user.username: system\:serviceaccount\:*
  and kubernetes.audit.annotations.authorization_k8s_io/decision: "forbid"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1613"
name = "Container and Resource Discovery"
reference = "https://attack.mitre.org/techniques/T1613/"


[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

