[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Austin Songer"]
description = """
Identifies when a user has disabled or deleted an EventBridge rule. This activity can result in an unintended loss of
visibility in applications or a break in the flow with other AWS services.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    EventBridge Rules could be deleted or disabled by a system administrator. Verify whether the user identity, user
    agent, and/or hostname should be making changes in your environment. EventBridge Rules being deleted or disabled by
    unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the
    rule.
    """,
]
from = "now-20m"
index = ["filebeat-*", "logs-aws.cloudtrail-*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "AWS EventBridge Rule Disabled or Deleted [Duplicate]"
note = ""
references = [
    "https://docs.aws.amazon.com/eventbridge/latest/APIReference/API_DeleteRule.html",
    "https://docs.aws.amazon.com/eventbridge/latest/APIReference/API_DisableRule.html",
]
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "0ffe89ec-8e5b-4a2d-8b61-8ffc57f1e7d3"
setup = ""
severity = "low"
severity_mapping = []
tags = ["Domain: Cloud", "Data Source: AWS", "Data Source: Amazon Web Services", "Tactic: Impact"]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:eventbridge.amazonaws.com and event.action:(DeleteRule or DisableRule) and
event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1489"
name = "Service Stop"
reference = "https://attack.mitre.org/techniques/T1489/"


[rule.threat.tactic]
id = "TA0040"
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"

