[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic", "Austin Songer"]
description = """
Identifies when new Service Principal credentials have been added in Azure. In most organizations, credentials will be
added to service principals infrequently. Hijacking an application (by adding a rogue secret or certificate) with
granted permissions will allow the attacker to access data that is normally protected by MFA requirements.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Service principal credential additions may be done by a system or network administrator. Verify whether the
    username, hostname, and/or resource name should be making changes in your environment. Credential additions from
    unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted
    from the rule.
    """,
]
from = "now-25m"
index = ["filebeat-*", "logs-azure*", "logs-logen-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Azure Service Principal Credentials Added [Duplicate]"
note = ""
references = ["https://www.fireeye.com/content/dam/collateral/en/wp-m-unc2452.pdf"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "825a4f08-b96b-440a-a05d-8153782aa58b"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Domain: Cloud", "Data Source: Azure", "Use Case: Identity and Access Audit", "Tactic: Impact"]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:azure.auditlogs and azure.auditlogs.operation_name:"Add service principal credentials" and event.outcome:(success or Success)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1496"
name = "Resource Hijacking"
reference = "https://attack.mitre.org/techniques/T1496/"


[rule.threat.tactic]
id = "TA0040"
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"

