[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Xavier Pich"]
description = """
Identifies attempts to disable or schedule the deletion of an AWS KMS Customer Managed Key (CMK). Deleting an AWS KMS
key is destructive and potentially dangerous. It deletes the key material and all metadata associated with the KMS key
and is irreversible. After a KMS key is deleted, the data that was encrypted under that KMS key can no longer be
decrypted, which means that data becomes unrecoverable.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    A KMS customer managed key may be disabled or scheduled for deletion by a system administrator. Verify whether the
    user identity, user agent, and/or hostname should be making changes in your environment. Key deletions by unfamiliar
    users should be investigated. If known behavior is causing false positives, it can be exempted from the rule.
    """,
]
from = "now-60m"
index = ["filebeat-*", "logs-aws.cloudtrail-*", "logs-logen-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "AWS KMS Customer Managed Key Disabled or Scheduled for Deletion [Duplicate]"
note = ""
references = [
    "https://docs.aws.amazon.com/cli/latest/reference/kms/disable-key.html",
    "https://docs.aws.amazon.com/cli/latest/reference/kms/schedule-key-deletion.html",
]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "fc81683e-1840-4194-8553-39f4eed7d8e0"
setup = ""
severity = "medium"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: AWS KMS",
    "Use Case: Log Auditing",
    "Tactic: Impact",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:kms.amazonaws.com and event.action:("DisableKey" or "ScheduleKeyDeletion") and event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1485"
name = "Data Destruction"
reference = "https://attack.mitre.org/techniques/T1485/"


[rule.threat.tactic]
id = "TA0040"
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"

