[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Identifies when a service account is disabled in Google Cloud Platform (GCP). A service account is a special type of
account used by an application or a virtual machine (VM) instance, not a person. Applications use service accounts to
make authorized API calls, authorized as either the service account itself, or as G Suite or Cloud Identity users
through domain-wide delegation. An adversary may disable a service account in order to disrupt to disrupt their target's
business operations.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    Service accounts may be disabled by system administrators. Verify that the behavior was expected. Exceptions can be
    added to this rule to filter expected behavior.
    """,
]
from = "now-6m"
index = ["filebeat-*", "logs-gcp*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "GCP Service Account Disabled [Duplicate]"
note = ""
references = ["https://cloud.google.com/iam/docs/service-accounts"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "a7fb6d32-a077-4b36-8b8b-5e92fe4bf0cb"
setup = ""
severity = "medium"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: GCP",
    "Data Source: Google Cloud Platform",
    "Use Case: Identity and Access Audit",
    "Tactic: Impact",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:gcp.audit and event.action:google.iam.admin.v*.DisableServiceAccount and event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1531"
name = "Account Access Removal"
reference = "https://attack.mitre.org/techniques/T1531/"


[rule.threat.tactic]
id = "TA0040"
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"

