[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
This rule uses alert data to determine when multiple alerts in different phases of an attack involving the same host are
triggered. Analysts can use this to prioritize triage and response, as these hosts are more likely to be compromised.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    False positives can occur because the rules may be mapped to a few MITRE ATT&CK tactics. Use the attached Timeline
    to determine which detections were triggered on the host.
    """,
]
from = "now-24h"
index = [".alerts-security.*", "logs-logen-*"]
interval = "1h"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Multiple Alerts in Different ATT&CK Tactics on a Single Host [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "bfabad34-a6fa-462b-a06b-6811f01a4355"
setup = ""
severity = "high"
severity_mapping = []
tags = ["Use Case: Threat Detection", "Rule Type: Higher-Order Rule"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "threshold"

query = '''
signal.rule.name:* and kibana.alert.rule.threat.tactic.id:*
'''



[rule.threshold]
field = ["host.id"]
value = 1
[[rule.threshold.cardinality]]
field = "kibana.alert.rule.threat.tactic.id"
value = 3


