[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Okta ThreatInsight is a feature that provides valuable debug data regarding authentication and authorization processes,
which is logged in the system. Within this data, there is a specific field called threat_suspected, which represents
Okta's internal evaluation of the authentication or authorization workflow. When this field is set to True, it suggests
the presence of potential credential access techniques, such as password-spraying, brute-forcing, replay attacks, and
other similar threats.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-6m"
index = ["filebeat-*", "logs-okta*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Okta ThreatInsight Threat Suspected Promotion [Duplicate]"
note = """## Triage and analysis

This is a promotion rule for Okta ThreatInsight suspected threat events, which are alertable events per the vendor.
Consult vendor documentation on interpreting specific events."""
references = [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/",
    "https://help.okta.com/en-us/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.html",
    "https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy",
]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "f155bdf6-edbf-4179-bf98-ac52b2a0cfdb"
rule_name_override = "okta.display_message"
setup = ""
severity = "medium"
tags = ["Use Case: Identity and Access Audit", "Data Source: Okta"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:okta.system and (event.action:security.threat.detected or okta.debug_context.debug_data.threat_suspected: true)
'''


[[rule.severity_mapping]]
field = "okta.debug_context.debug_data.risk_level"
operator = "equals"
severity = "low"
value = "LOW"

[[rule.severity_mapping]]
field = "okta.debug_context.debug_data.risk_level"
operator = "equals"
severity = "medium"
value = "MEDIUM"

[[rule.severity_mapping]]
field = "okta.debug_context.debug_data.risk_level"
operator = "equals"
severity = "high"
value = "HIGH"


