[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic", "Austin Songer"]
description = "Identifies when an AWS Route Table has been created."
enabled = true
exceptions_list = []
false_positives = [
    """
    Route Tables may be created by a system or network administrators. Verify whether the user identity, user agent,
    and/or hostname should be making changes in your environment. Route Table creation by unfamiliar users or hosts
    should be investigated. If known behavior is causing false positives, it can be exempted from the rule. Automated
    processes that use Terraform may lead to false positives.
    """,
]
from = "now-60m"
index = ["filebeat-*", "logs-aws.cloudtrail-*", "logs-logen-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "AWS Route Table Created [Duplicate]"
note = ""
references = [
    "https://docs.datadoghq.com/security_platform/default_rules/aws-ec2-route-table-modified/",
    "https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_CreateRoute.html",
    "https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_CreateRouteTable",
]
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "b2ffd11e-e2e7-45f4-90f3-287f48b4db2a"
setup = ""
severity = "low"
severity_mapping = []
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: AWS Route53",
    "Use Case: Network Security Monitoring",
    "Tactic: Persistence",
]
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:ec2.amazonaws.com and event.action:(CreateRoute or CreateRouteTable) and
event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
technique = []

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

