[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Detects attempts to exploit privilege escalation vulnerabilities related to the Print Spooler service. For more
information refer to the following CVE's - CVE-2020-1048, CVE-2020-1337 and CVE-2020-1300 and verify that the impacted
system is patched.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-9m"
index = [
    "winlogbeat-*",
    "logs-endpoint.events.file-*",
    "logs-windows.sysmon_operational-*",
    "endgame-*",
    "logs-logen-*",
]
interval = "5m"
language = "eql"
license = "Elastic License v2"
max_signals = 100
name = "Suspicious PrintSpooler Service Executable File Creation [Duplicate]"
references = [
    "https://voidsec.com/cve-2020-1337-printdemon-is-dead-long-live-printdemon/",
    "https://www.thezdi.com/blog/2020/7/8/cve-2020-1300-remote-code-execution-through-microsoft-windows-cab-files",
]
related_integrations = []
required_fields = []
risk_score = 73
risk_score_mapping = []
rule_id = "eff4a9d3-769a-40e8-a059-de83bf1a0ad8"
setup = ""
severity = "high"
severity_mapping = []
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Data Source: Elastic Endgame",
    "Use Case: Vulnerability",
    "Data Source: Elastic Defend",
    "Data Source: Sysmon",
]
timestamp_override = "event.ingested"
to = "now"
type = "eql"

query = '''
file where host.os.type == "windows" and event.type == "creation" and
  process.name : "spoolsv.exe" and file.extension : "dll" and
  file.path : ("?:\\Windows\\System32\\*", "?:\\Windows\\SysWOW64\\*") and
  not file.path : (
    "?:\\WINDOWS\\SysWOW64\\PrintConfig.dll",
    "?:\\WINDOWS\\system32\\x5lrs.dll",
    "?:\\WINDOWS\\sysWOW64\\x5lrs.dll",
    "?:\\WINDOWS\\system32\\PrintConfig.dll",
    "?:\\WINDOWS\\system32\\spool\\DRIVERS\\x64\\*.dll",
    "?:\\WINDOWS\\system32\\spool\\DRIVERS\\W32X86\\*.dll",
    "?:\\WINDOWS\\system32\\spool\\PRTPROCS\\x64\\*.dll",
    "?:\\WINDOWS\\system32\\spool\\{????????-????-????-????-????????????}\\*.dll"
  )
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1068"
name = "Exploitation for Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1068/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

