[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
Elastic Endgame detected ransomware. Click the Elastic Endgame icon in the event.module column or the link in the
rule.reference column for additional information.
"""
enabled = true
exceptions_list = []
false_positives = []
from = "now-15m"
index = ["endgame-*", "logs-logen-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
max_signals = 10000
name = "Ransomware - Detected - Elastic Endgame [Duplicate]"
references = []
related_integrations = []
required_fields = []
risk_score = 99
risk_score_mapping = []
rule_id = "1799f19e-647c-454b-919c-1038bf725d41"
setup = ""
severity = "critical"
severity_mapping = []
tags = ["Data Source: Elastic Endgame"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
event.kind:alert and event.module:endgame and endgame.metadata.type:detection and (event.action:ransomware_event or endgame.event_subtype_full:ransomware_event)
'''

