[metadata]
creation_date = "2024/05/27"
maturity = "production"
updated_date = "2024/05/27"

[rule]
actions = []
author = ["Elastic"]
description = """
This is an example of how to detect an unwanted web client user agent. This search matches the user agent for sqlmap
1.3.11, which is a popular FOSS tool for testing web applications for SQL injection vulnerabilities.
"""
enabled = true
exceptions_list = []
false_positives = [
    """
    This rule does not indicate that a SQL injection attack occurred, only that the `sqlmap` tool was used. Security
    scans and tests may result in these errors. If the source is not an authorized security tester, this is generally
    suspicious or malicious activity.
    """,
]
from = "now-6m"
index = ["apm-*-transaction*", "traces-apm*", "logs-logen-*"]
interval = "5m"
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Web Application Suspicious Activity: sqlmap User Agent [Duplicate]"
references = ["http://sqlmap.org/"]
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "82ae1954-7027-4689-844c-98ca29579eba"
setup = ""
severity = "medium"
severity_mapping = []
tags = ["Data Source: APM"]
threat = []
timestamp_override = "event.ingested"
to = "now"
type = "query"

query = '''
user_agent.original:"sqlmap/1.3.11#stable (http://sqlmap.org)"
'''

